grevaillot/svd_tools/headers/STM32L15xC/memorymap.h
#pragma once 

#define TIM2_BASE			(0x40000000)
#define TIM3_BASE			(0x40000400)
#define TIM4_BASE			(0x40000800)
#define TIM5_BASE			(0x40000c00)
#define TIM6_BASE			(0x40001000)
#define TIM7_BASE			(0x40001400)
#define LCD_BASE			(0x40002400)
#define RTC_BASE			(0x40002800)
#define WWDG_BASE			(0x40002c00)
#define IWDG_BASE			(0x40003000)
#define SPI2_BASE			(0x40003800)
#define SPI3_BASE			(0x40003c00)
#define USART2_BASE			(0x40004400)
#define USART3_BASE			(0x40004800)
#define I2C1_BASE			(0x40005400)
#define I2C2_BASE			(0x40005800)
#define USB_BASE			(0x40005c00)
#define USB_SRAM_BASE			(0x40006000)
#define PWR_BASE			(0x40007000)
#define DAC_BASE			(0x40007400)
#define COMP_BASE			(0x40007c00)
#define RI_BASE			(0x40007c04)
#define OPAMP_BASE			(0x40007c5c)
#define SYSCFG_BASE			(0x40010000)
#define EXTI_BASE			(0x40010400)
#define TIM9_BASE			(0x40010800)
#define TIM10_BASE			(0x40010c00)
#define TIM11_BASE			(0x40011000)
#define ADC_BASE			(0x40012400)
#define C_ADC_BASE			(0x40012700)
#define SPI1_BASE			(0x40013000)
#define USART1_BASE			(0x40013800)
#define GPIOA_BASE			(0x40020000)
#define GPIOB_BASE			(0x40020400)
#define GPIOC_BASE			(0x40020800)
#define GPIOD_BASE			(0x40020c00)
#define GPIOE_BASE			(0x40021000)
#define GPIOH_BASE			(0x40021400)
#define GPIOF_BASE			(0x40021800)
#define GPIOG_BASE			(0x40021c00)
#define CRC_BASE			(0x40023000)
#define RCC_BASE			(0x40023800)
#define Flash_BASE			(0x40023c00)
#define DMA1_BASE			(0x40026000)
#define DMA2_BASE			(0x40026400)
#define NVIC_BASE			(0xe000e000)
#define DBG_BASE			(0xe0042000)
